/* errAuthorizationInvalidSet */
"-60001" = "Права авторизации недействительны.";

/* errAuthorizationInvalidRef */
"-60002" = "Ссылка авторизации недействительна.";

/* errAuthorizationInvalidTag */
"-60003" = "Тег авторизации недействителен.";

/* errAuthorizationInvalidPointer */
"-60004" = "Авторизация возврата недействительна.";

/* errAuthorizationDenied */
"-60005" = "Было отказано в идентификации.";

/* errAuthorizationCanceled */
"-60006" = "Идентификация была отменена пользователем.";

/* errAuthorizationInteractionNotAllowed */
"-60007" = "Было отказано в идентификации, т.к. невозможно пользовательское взаимодействие.";

/* errAuthorizationInternal */
"-60008" = "Не удается получить авторизацию для этой операции.";

/* errAuthorizationExternalizeNotAllowed */
"-60009" = "Не разрешена конвертация авторизации во внешний формат.";

/* errAuthorizationInternalizeNotAllowed */
"-60010" = "Не разрешено создание авторизации из внешнего формата.";

/* errAuthorizationInvalidFlags */
"-60011" = "Отмеченная опция недействительна для этой авторизованной операции.";

/* errAuthorizationToolExecuteFailure */
"-60031" = "Указанную программу не удалось выполнить.";

/* errAuthorizationToolEnvironmentError */
"-60032" = "Возвращен недействительный статус во время выполнения привилегированного элемента.";

/* errAuthorizationBadAddress */
"-60033" = "Запрошенный socket-адрес недействителен (должен быть 0-1023 включительно).";

/* errSSLProtocol */
"-9800" = "Ошибка SSL-протокола";

/* errSSLNegotiation */
"-9801" = "Ошибка оценки Cipher Suite";

/* errSSLFatalAlert */
"-9802" = "Предупреждение о необратимой ошибке";

/* errSSLWouldBlock */
"-9803" = "Ввод/вывод будет блокирован (не фатальная ситуация)";

/* errSSLSessionNotFound */
"-9804" = "попытка восстановить неизвестный сеанс";

/* errSSLClosedGraceful */
"-9805" = "подключение закрыто благополучно";

/* errSSLClosedAbort */
"-9806" = "подключение закрыто с ошибкой";

/* errSSLXCertChainInvalid */
"-9807" = "недействительная цепь сертификатов";

/* errSSLBadCert */
"-9808" = "плохой формат сертификата";

/* errSSLCrypto */
"-9809" = "криптографическая ошибка в основе";

/* errSSLInternal */
"-9810" = "Внутренняя ошибка";

/* errSSLModuleAttach */
"-9811" = "ошибка подключения модуля";

/* errSSLUnknownRootCert */
"-9812" = "правильная цепочка сертификатов, неверный главный издатель";

/* errSSLNoRootCert */
"-9813" = "цепочка сертификатов не проверена корнем root";

/* errSSLCertExpired */
"-9814" = "цепочка сертификатов с истекшим сроком сертификата";

/* errSSLCertNotYetValid */
"-9815" = "цепочка сертификатов с еще не наступившим сроком сертификата";

/* errSSLClosedNoNotify */
"-9816" = "сервер закрыл сеанс без предупреждения";

/* errSSLBufferOverflow */
"-9817" = "предоставлен недостаточный буфер";

/* errSSLBadCipherSuite */
"-9818" = "плохой SSLCipherSuite";

/* errSSLPeerUnexpectedMsg */
"-9819" = "принято неожиданное сообщение";

/* errSSLPeerBadRecordMac */
"-9820" = "недействительный MAC";

/* errSSLPeerDecryptionFail */
"-9821" = "расшифровка не прошла";

/* errSSLPeerRecordOverflow */
"-9822" = "переполнение записи";

/* errSSLPeerDecompressFail */
"-9823" = "ошибка декомпрессии";

/* errSSLPeerHandshakeFail */
"-9824" = "ошибка handshake";

/* errSSLPeerBadCert */
"-9825" = "недействительный сертификат (различные причины)";

/* errSSLPeerUnsupportedCert */
"-9826" = "недействительный, неподдержанный формат сертификата";

/* errSSLPeerCertRevoked */
"-9827" = "сертификат вызван вновь";

/* errSSLPeerCertExpired */
"-9828" = "срок сертификата истек";

/* errSSLPeerCertUnknown */
"-9829" = "неизвестный сертификат";

/* errSSLIllegalParam */
"-9830" = "неразрешенный параметр";

/* errSSLPeerUnknownCA */
"-9831" = "неизвестный источник сертификата";

/* errSSLPeerAccessDenied */
"-9832" = "отказано в доступе";

/* errSSLPeerDecodeError */
"-9833" = "ошибка декодирования";

/* errSSLPeerDecryptError */
"-9834" = "ошибка расшифровки";

/* errSSLPeerExportRestriction */
"-9835" = "ограничение экспорта";

/* errSSLPeerProtocolVersion */
"-9836" = "версия плохого протокола";

/* errSSLPeerInsufficientSecurity */
"-9837" = "недостаточная безопасность";

/* errSSLPeerInternalError */
"-9838" = "внутренняя ошибка";

/* errSSLPeerUserCancelled */
"-9839" = "отменено пользователем";

/* errSSLPeerNoRenegotiation */
"-9840" = "не позволена повторная оценка";

/* errSSLServerAuthCompleted */
"-9841" = "сервер имеет действительный сертификат, или сертификат пропущен, если проверка отключена";

/* errSSLClientCertRequested */
"-9842" = "сервер запросил сертификат клиента";

/* errSSLHostNameMismatch */
"-9843" = "несовпадение имени хоста";

/* errSSLConnectionRefused */
"-9844" = "узел прервал подключение до ответа";

/* errSSLDecryptionFail */
"-9845" = "отказ в процессе расшифровки";

/* errSSLBadRecordMac */
"-9846" = "недействительный MAC";

/* errSSLRecordOverflow */
"-9847" = "переполнение записи";

/* errSSLBadConfiguration */
"-9848" = "ошибка конфигурации";

/* errSecSuccess */
"0" = "Нет ошибок.";

/* errSecUnimplemented */
"-4" = "Функция или операция не применены.";

/* errSecParam */
"-50" = "Как минимум один параметр, переданный функции, был недействителен.";

/* errSecAllocate */
"-108" = "Не удалось выделить память.";

/* errSecNotAvailable */
"-25291" = "Нет доступных Связок ключей. Возможно, Вам придется перезагрузить компьютер.";

/* errSecReadOnly */
"-25292" = "Не удается модифицировать эту Связку ключей.";

/* errSecAuthFailed */
"-25293" = "Имя пользователя или введенный Вами пароль неверны.";

/* errSecNoSuchKeychain */
"-25294" = "Не удается найти указанную Связку ключей.";

/* errSecInvalidKeychain */
"-25295" = "Указанная Связка ключей не является действительным файлом связки ключей.";

/* errSecDuplicateKeychain */
"-25296" = "Связка ключей с тем же именем уже существует.";

/* errSecDuplicateCallback */
"-25297" = "Указанная функция ответа (callback) уже установлена.";

/* errSecInvalidCallback */
"-25298" = "Указанная функция ответа (callback) недействительна.";

/* errSecDuplicateItem */
"-25299" = "Указанный объект уже существует в этой Связке ключей.";

/* errSecItemNotFound */
"-25300" = "Не удается найти указанный объект в Связке ключей.";

/* errSecBufferTooSmall */
"-25301" = "Недостаточно памяти для использования указанного объекта.";

/* errSecDataTooLarge */
"-25302" = "Этот объект содержит информацию, которая является слишком длинной или в формате, который невозможно отобразить на экране.";

/* errSecNoSuchAttr */
"-25303" = "Указанный атрибут не существует.";

/* errSecInvalidItemRef */
"-25304" = "Указанный объект больше не действителен. Возможно, он был удален из Связки ключей.";

/* errSecInvalidSearchRef */
"-25305" = "Не удается найти текущую Связку ключей.";

/* errSecNoSuchClass */
"-25306" = "Возможно, указанный объект больше не является действительным объектом Связки ключей.";

/* errSecNoDefaultKeychain */
"-25307" = "Не удается найти стандартную Связку ключей.";

/* errSecInteractionNotAllowed */
"-25308" = "Пользовательское взаимодействие не разрешено.";

/* errSecReadOnlyAttr */
"-25309" = "Не удается модифицировать указанный атрибут.";

/* errSecWrongSecVersion */
"-25310" = "Эта Связка ключей создана другой версией системного программного обеспечения, и ее невозможно открыть.";

/* errSecKeySizeNotAllowed */
"-25311" = "Этот объект задает слишком длинный размер ключа.";

/* errSecNoStorageModule */
"-25312" = "Невозможно загрузить требуемый компонент (модуль хранения данных). Возможно, Вам придется перезагрузить компьютер.";

/* errSecNoCertificateModule */
"-25313" = "Невозможно загрузить требуемый компонент (модуль сертификата). Возможно, Вам придется перезагрузить компьютер.";

/* errSecNoPolicyModule */
"-25314" = "Невозможно загрузить требуемый компонент (модуль policy). Возможно, Вам придется перезагрузить компьютер.";

/* errSecInteractionRequired */
"-25315" = "Пользовательское взаимодействие требуется, но не разрешено.";

/* errSecDataNotAvailable */
"-25316" = "Содержимое этого объекта не может быть извлечено.";

/* errSecDataNotModifiable */
"-25317" = "Содержимое этого объекта не может быть модифицировано.";

/* errSecCreateChainFailed */
"-25318" = "Один или более сертификатов, необходимых для проверки данного сертификата, не могут быть найдены.";

/* errSecInvalidPrefsDomain */
"-25319" = "Указанный домен настроек недействителен.";

/* errSecACLNotSimple */
"-25240" = "Указанный список контроля доступа не находится в стандартной (простой) форме.";

/* errSecPolicyNotFound */
"-25241" = "Не удается найти указанные правила.";

/* errSecInvalidTrustSetting */
"-25242" = "Указанная настройка доверия неверна.";

/* errSecNoAccessForItem */
"-25243" = "Указанный объект не имеет контроля доступа.";

/* errSecInvalidOwnerEdit */
"-25244" = "Неверная попытка изменить владельца этого объекта.";

/* errSecTrustNotAvailable */
"-25245" = "Нет доступных результатов доверия.";

/* errSecUnsupportedFormat */
"-25256" = "Не поддерживается формат импорта/экспорта.";

/* errSecUnknownFormat */
"-25257" = "Неизвестный формат импорта.";

/* errSecKeyIsSensitive */
"-25258" = "Ключевой материал должен быть подготовлен (wrapped) для экспорта.";

/* errSecMultiplePrivKeys */
"-25259" = "Была попытка импортировать несколько личных ключей.";

/* errSecPassphraseRequired */
"-25260" = "Для импорта/экспорта требуется пароль (passphrase).";

/* errSecInvalidPasswordRef */
"-25261" = "Ссылка на пароль неверна.";

/* errSecInvalidTrustSettings */
"-25262" = "Запись настроек доверия была прервана.";

/* errSecNoTrustSettings */
"-25263" = "Настройки доверия не обнаружены.";

/* errSecPkcs12VerifyFailure */
"-25264" = "Проверка MAC не удалась в течение импорта PKCS12.";

/* errSecDecode */
"-26275" = "Не удается декодировать предоставленные данные.";

/* CSSMERR_CSP_INVALID_DATA_COUNT */
"-2147415768" = "Значения ошибки буферов вектора CSP.";

/* CSSMERR_CSP_INVALID_CONTEXT */
"-2147415760" = "Значения ошибки ступенчатого контекста CSP.";

/* CSSMERR_CSP_STAGED_OPERATION_IN_PROGRESS */
"-2147415736" = "Значения ошибки ступенчатого криптографического API CSP.";

/* CSSMERR_CSP_APPLE_PUBLIC_KEY_INCOMPLETE */
"-2147415039" = "* Была попытка использовать открытый ключ, являющийся неполным из-за * отсутствия алгоритмических параметров.";

/* CSSMERR_CSP_APPLE_SIGNATURE_MISMATCH */
"-2147415038" = "кодовая подпись не совпала";

/* CSSMERR_CSP_APPLE_INVALID_KEY_START_DATE */
"-2147415037" = "Ключ StartDate/EndDate неверен";

/* CSSMERR_CSPDL_APPLE_DL_CONVERSION_ERROR */
"-2147415035" = "коды ошибки синхронизации связки ключей";

/* CSSMERR_CSP_APPLE_SSLv2_ROLLBACK */
"-2147415034" = "проверить заполнение SSLv2: атака отката обнаружена";

/* CSSMERR_APPLEDL_INVALID_OPEN_PARAMETERS */
"-2147412992" = "Аргумент OpenParameters, переданный CSSM_DL_DbCreate или CSSM_DL_DbOpen, не был ни нулем, ни указателем правильной структуры CSSM_APPLEDL_OPEN_PARAMETERS.";

/* CSSMERR_APPLEDL_DISK_FULL */
"-2147412991" = "операция не удалась, т.к. диск был заполнен";

/* CSSMERR_APPLEDL_QUOTA_EXCEEDED */
"-2147412990" = "операция не удалась, т.к. квота диска была превышена";

/* CSSMERR_APPLEDL_FILE_TOO_BIG */
"-2147412989" = "операция не удалась, т.к. файл был слишком большой";

/* CSSMERR_APPLEDL_INVALID_DATABASE_BLOB */
"-2147412988" = "Внутренняя информация (-blob-) базы данных неверна";

/* CSSMERR_APPLEDL_INCOMPATIBLE_DATABASE_BLOB */
"-2147412986" = "версия формата внутренних данных для внутренней информации (-blob-) базы данных неверна";

/* CSSMERR_APPLETP_HOSTNAME_MISMATCH */
"-2147408896" = "Несовпадение имени хоста";

/* CSSMERR_APPLETP_UNKNOWN_CRITICAL_EXTEN */
"-2147408895" = "Непонятое расширение с критическим флагом верно";

/* CSSMERR_APPLETP_NO_BASIC_CONSTRAINTS */
"-2147408894" = "Расширение Basic Constraints необходимо для политики, но отсутсвует";

/* CSSMERR_APPLETP_INVALID_CA */
"-2147408893" = "Неверные BasicConstraits.CA";

/* CSSMERR_APPLETP_INVALID_AUTHORITY_ID */
"-2147408892" = "Неверный ID бюро сертификации";

/* CSSMERR_APPLETP_INVALID_SUBJECT_ID */
"-2147408891" = "Неверный ID ключа субъекта";

/* CSSMERR_APPLETP_INVALID_KEY_USAGE */
"-2147408890" = "Неверное использование ключа для политики";

/* CSSMERR_APPLETP_INVALID_EXTENDED_KEY_USAGE */
"-2147408889" = "Неверное расширенное использование ключа для политики";

/* CSSMERR_APPLETP_INVALID_ID_LINKAGE */
"-2147408888" = "Неверный субъект/связь ID ключа CA";

/* CSSMERR_APPLETP_PATH_LEN_CONSTRAINT */
"-2147408887" = "PathLengthConstraint превышен";

/* CSSMERR_APPLETP_INVALID_ROOT */
"-2147408886" = "Группа сертификатов прервана в корневом сертификате, который не провел самопроверку";

/* CSSMERR_APPLETP_CRL_EXPIRED */
"-2147408885" = "Срок CRL истек/больше не действителен";

/* CSSMERR_APPLETP_CRL_NOT_FOUND */
"-2147408883" = "Не удается найти дорожку соответствующего CRL";

/* CSSMERR_APPLETP_CRL_SERVER_DOWN */
"-2147408882" = "указанный сервер CRL отключен";

/* CSSMERR_APPLETP_CRL_BAD_URI */
"-2147408881" = "URL точки распределения недопустимого CRL";

/* CSSMERR_APPLETP_UNKNOWN_CERT_EXTEN */
"-2147408880" = "Неизвестный критический сертификат/расширение CRL";

/* CSSMERR_APPLETP_CRL_NOT_TRUSTED */
"-2147408878" = "CRL не проверяется по привязке или корню";

/* CSSMERR_APPLETP_CRL_INVALID_ANCHOR_CERT */
"-2147408877" = "CRL проверен по ненадежному корню";

/* CSSMERR_APPLETP_CRL_POLICY_FAIL */
"-2147408876" = "CRL не прошел проверку политики";

/* CSSMERR_APPLETP_IDP_FAIL */
"-2147408875" = "Нарушение расширения IssuingDistributionPoint";

/* CSSMERR_APPLETP_CERT_NOT_FOUND_FROM_ISSUER */
"-2147408874" = "Сертификат не найден в указанном issuerAltName";

/* CSSMERR_APPLETP_BAD_CERT_FROM_ISSUER */
"-2147408873" = "Неверный сертификат получен от указанного issuerAltName";

/* CSSMERR_APPLETP_SMIME_EMAIL_ADDRS_NOT_FOUND */
"-2147408872" = "Несовпадение адреса e-mail S/MIME";

/* CSSMERR_APPLETP_SMIME_BAD_EXT_KEY_USE */
"-2147408871" = "Соответствующий S/MIME ExtendedKeyUsage не найден ";

/* CSSMERR_APPLETP_SMIME_BAD_KEY_USE */
"-2147408870" = "Несовместимость S/MIME KeyUsage";

/* CSSMERR_APPLETP_SMIME_KEYUSAGE_NOT_CRITICAL */
"-2147408869" = "S/MIME, сертификат с KeyUsage отмеченный ! - критический";

/* CSSMERR_APPLETP_SMIME_NO_EMAIL_ADDRS */
"-2147408868" = "S/MIME, лист с пустым именем темы и без адресовв e-mail * в SubjectAltName";

/* CSSMERR_APPLETP_SMIME_SUBJ_ALT_NAME_NOT_CRIT */
"-2147408867" = "S/MIME, лист с пустым именем темы, SubjectAltName * не критический";

/* CSSMERR_APPLETP_SSL_BAD_EXT_KEY_USE */
"-2147408866" = "Соответствующий SSL ExtendedKeyUsage не найден";

/* CSSMERR_APPLETP_OCSP_BAD_RESPONSE */
"-2147408865" = "грамматически неанализируемый запрос OCSP";

/* CSSMERR_APPLETP_OCSP_BAD_REQUEST */
"-2147408864" = "грамматически неанализируемый запрос OCSP";

/* CSSMERR_APPLETP_OCSP_UNAVAILABLE */
"-2147408863" = "служба OCSP отсутствует";

/* CSSMERR_APPLETP_OCSP_STATUS_UNRECOGNIZED */
"-2147408862" = "статус OCSP: сертификат не узнан";

/* CSSMERR_APPLETP_INCOMPLETE_REVOCATION_CHECK */
"-2147408861" = "проверка аннулирования безуспешна для каждого сертификата";

/* CSSMERR_APPLETP_NETWORK_FAILURE */
"-2147408860" = "общая ошибка сети";

/* CSSMERR_APPLETP_OCSP_NOT_TRUSTED */
"-2147408859" = "ответ OCSP не проверяется по привязке или корню";

/* CSSMERR_APPLETP_OCSP_INVALID_ANCHOR_CERT */
"-2147408858" = "ответ OCSP, проверенный по ненадежному корню";

/* CSSMERR_APPLETP_OCSP_SIG_ERROR */
"-2147408857" = "ошибка подписи ответа OCSP";

/* CSSMERR_APPLETP_OCSP_NO_SIGNER */
"-2147408856" = "Подписывающий для ответа OCSP не найден";

/* CSSMERR_APPLETP_OCSP_RESP_MALFORMED_REQ */
"-2147408855" = "статус реагирующего объекта OCSP: искаженный запрос";

/* CSSMERR_APPLETP_OCSP_RESP_INTERNAL_ERR */
"-2147408854" = "статус реагирующего объекта OCSP: внутренняя ошибка";

/* CSSMERR_APPLETP_OCSP_RESP_TRY_LATER */
"-2147408853" = "статус реагирующего объекта OCSP: попытайтесь позже";

/* CSSMERR_APPLETP_OCSP_RESP_SIG_REQUIRED */
"-2147408852" = "статус реагирующего объекта OCSP: необходима подпись";

/* CSSMERR_APPLETP_OCSP_RESP_UNAUTHORIZED */
"-2147408851" = "статус реагирующего объекта OCSP: неавторизован";

/* CSSMERR_APPLETP_OCSP_NONCE_MISMATCH */
"-2147408850" = "специальное значение ответа OCSP не совпало с запросом";

/* CSSMERR_APPLETP_CS_BAD_CERT_CHAIN_LENGTH */
"-2147408849" = "недопустимая длина цепочки сертификатов для кодовой подписи";

/* CSSMERR_APPLETP_CS_NO_BASIC_CONSTRAINTS */
"-2147408848" = "Отсутствующие основные ограничения для кодовой подписи";

/* CSSMERR_APPLETP_CS_BAD_PATH_LENGTH */
"-2147408847" = "Неверный PathLengthConstraint для кодовой подписи";

/* CSSMERR_APPLETP_CS_NO_EXTENDED_KEY_USAGE */
"-2147408846" = "Отсутствующий ExtendedKeyUsage для кодовой подписи";

/* CSSMERR_APPLETP_CODE_SIGN_DEVELOPMENT */
"-2147408845" = "Обнаруженное сертификатом кодовой подписи для стиля разработки";

/* CSSMERR_APPLETP_RS_BAD_CERT_CHAIN_LENGTH */
"-2147408844" = "недопустимая длина цепочки сертификатов для ресурсовой подписи";

/* CSSMERR_APPLETP_RS_BAD_EXTENDED_KEY_USAGE */
"-2147408843" = "неверное расширенное использование ключа для ресурсовой подписи";

/* CSSMERR_APPLETP_TRUST_SETTING_DENY */
"-2147408842" = "Подтвержденный параметр: отказать";

/* CSSMERR_APPLETP_INVALID_EMPTY_SUBJECT */
"-2147408841" = "неверный пустой SubjectName";

/* CSSMERR_APPLETP_UNKNOWN_QUAL_CERT_STATEMENT */
"-2147408840" = "неизвестный критический ID квалифицированного оператора сертификата";

/* CSSMERR_APPLE_DOTMAC_REQ_QUEUED */
"-2147408796" = "запрос сертификата поставлен в очередь";

/* CSSMERR_APPLE_DOTMAC_REQ_REDIRECT */
"-2147408795" = "запрос сертификата перенаправлен";

/* CSSMERR_APPLE_DOTMAC_REQ_SERVER_ERR */
"-2147408794" = "сообщение сервера: общая ошибка";

/* CSSMERR_APPLE_DOTMAC_REQ_SERVER_PARAM */
"-2147408793" = "сообщение сервера: ошибка параметра";

/* CSSMERR_APPLE_DOTMAC_REQ_SERVER_AUTH */
"-2147408792" = "сообщение сервера: ошибка авторизации";

/* CSSMERR_APPLE_DOTMAC_REQ_SERVER_UNIMPL */
"-2147408791" = "сообщение сервера: неприменим";

/* CSSMERR_APPLE_DOTMAC_REQ_SERVER_NOT_AVAIL */
"-2147408790" = "сообщение сервера: отсутствует";

/* CSSMERR_APPLE_DOTMAC_REQ_SERVER_ALREADY_EXIST */
"-2147408789" = "сообщение сервера: уже существует";

/* CSSMERR_APPLE_DOTMAC_REQ_SERVER_SERVICE_ERROR */
"-2147408788" = "сервер сообщил об ошибке службы";

/* CSSMERR_APPLE_DOTMAC_REQ_IS_PENDING */
"-2147408787" = "запрос, уже отложенный для указанного пользователя";

/* CSSMERR_APPLE_DOTMAC_NO_REQ_PENDING */
"-2147408786" = "нет запроса, отложенного для указанного пользователя";

/* CSSMERR_APPLE_DOTMAC_CSR_VERIFY_FAIL */
"-2147408785" = "проверка CSR не удалась";

/* CSSMERR_APPLE_DOTMAC_FAILED_CONSISTENCY_CHECK */
"-2147408784" = "сервер сообщил о неудавшейся проверке согласованности";

/* errSecCSUnimplemented */
"-67072" = "неприменимое свойство кодовой подписи";

/* errSecCSInvalidObjectRef */
"-67071" = "неверная ссылка на объект API";

/* errSecCSInvalidFlags */
"-67070" = "неверные или несоответсвующие API-флаг(и) указаны";

/* errSecCSObjectRequired */
"-67069" = "необходимый аргумент указателя был равен нулю";

/* errSecCSStaticCodeNotFound */
"-67068" = "не удается найти объект кода на диске";

/* errSecCSUnsupportedGuestAttributes */
"-67067" = "не удается разместить гостей через данный набор атрибута";

/* errSecCSInvalidAttributeValues */
"-67066" = "указанные значения атрибута неверны";

/* errSecCSNoSuchCode */
"-67065" = "хост не имеет гостя с данным значением атрибута";

/* errSecCSMultipleGuests */
"-67064" = "хост имеет несколько гостей с данным значением атрибута";

/* errSecCSGuestInvalid */
"-67063" = "идентификация кода была аннулирована";

/* errSecCSUnsigned */
"-67062" = "объект кода не подписан";

/* errSecCSSignatureFailed */
"-67061" = "код и подпись изменены";

/* errSecCSSignatureNotVerifiable */
"-67060" = "подпись не читаема, например, из-за файловой системы, которая создает псевдокорневой каталог для непривилегированного пользователя";

/* errSecCSSignatureUnsupported */
"-67059" = "неподдерживаемые тип или версия подписи";

/* errSecCSBadDictionaryFormat */
"-67058" = "необходимые файл или ресурс формата plist искажены";

/* errSecCSResourcesNotSealed */
"-67057" = "ресурсы не подписаны";

/* errSecCSResourcesNotFound */
"-67056" = "не удается найти подписанные ресурсы в коде";

/* errSecCSResourcesInvalid */
"-67055" = "каталог подписанного ресурса неверен";

/* errSecCSBadResource */
"-67054" = "подписанный ресурс отсутствует или неверен";

/* errSecCSResourceRulesInvalid */
"-67053" = "неверные правила (правило) выбора источника";

/* errSecCSReqInvalid */
"-67052" = "неверные или поврежденное требование (требования) кода";

/* errSecCSReqUnsupported */
"-67051" = "неподдерживаемые тип или версия требования (требований) кода";

/* errSecCSReqFailed */
"-67050" = "не удалось удовлетворить требованию (требованиям) кода";

/* errSecCSBadObjectFormat */
"-67049" = "формат файла объекта неверен или негоден";

/* errSecCSInternalError */
"-67048" = "внутренняя ошибка в кодовой подписи подсистемы";

/* errSecCSHostReject */
"-67047" = "хост отклонен кодом";

/* errSecCSNotAHost */
"-67046" = "данный код не является хостом";

/* errSecCSSignatureInvalid */
"-67045" = "неверный формат для подписи";

/* errSecCSHostProtocolRelativePath */
"-67044" = "нарушение протокола хоста - требуется абсолютный адрес гостя";

/* errSecCSHostProtocolContradiction */
"-67043" = "нарушение протокола хоста - несовместимые хостинговые режимы";

/* errSecCSHostProtocolDedicationError */
"-67042" = "нарушение протокола хоста - особому гостю действие не разрешено";

/* errSecCSHostProtocolNotProxy */
"-67041" = "нарушение протокола хоста - не включен прокси-хостинг";

/* errSecCSHostProtocolStateError */
"-67040" = "нарушение протокола хоста - неверный запрос изменения статуса гостя";

/* errSecCSHostProtocolUnrelated */
"-67039" = "нарушение протокола хоста - указанный гость не является гостем данного хоста";

/* errSecCSInvalidOperation */
"-67038" = "требуемая операция недействительна";

/* errSecCSNotSupported */
"-67037" = "операция для этого типа кода не поддерживается";

/* errSecCSCMSTooLarge */
"-67036" = "подпись слишком большая, чтобы быть встроенной";

/* errSecCSHostProtocolInvalidHash */
"-67035" = "нарушение протокола хоста – неверный запрос хэш гостя";

/* errSecCSStaticCodeChanged */
"-67034" = "программа на диске не совпадает с запущенной";

/* errSecCSSigDBDenied */
"-67033" = "доступ к базе данных подписей отклонен";

/* errSecCSSigDBAccess */
"-67032" = "не удается доступ к базе данных подписей";

/* errSecCSHostProtocolInvalidAttribute */
"-67031" = "хост вернул недействительные или несогласованные атрибуты гостя";

/* errSecMisc_dskFulErr */
"-34" = "Диск заполнен.";

/* errSecMisc_nsvErr */
"-35" = "Не удалось найти диск. Возможно, он был извлечен из компьютера.";

/* errSecMisc_bdNamErr */
"-37" = "Была попытка открыть файл, имя которого содержит недопустимый символ.";

/* errSecMisc_fnfErr */
"-43" = "Не удается найти файл.";

/* errSecMisc_wPrErr */
"-44" = "Указанный диск защищен от записи.";

/* errSecMisc_fLckdErr */
"-45" = "Файл защищен от записи.";

/* errSecMisc_vLckdErr */
"-46" = "Том защищен от записи.";

/* errSecMisc_fBsyErr */
"-47" = "Файл сейчас занят. Возможно, он используется другой программой.";

/* errSecMisc_dupFNErr */
"-48" = "Файл с тем же именем уже существует.";

/* errSecMisc_opWrErr */
"-49" = "Файл уже открыт с правами записи.";

/* errSecMisc_volOffLinErr */
"-53" = "Указанный том более недоступен. Возможно, он был извлечен из компьютера.";

/* errSecMisc_permErr */
"-54" = "Невозможно открыть файл. Возможно, он используется другой программой.";

/* errSecMisc_extFSErr */
"-58" = "Вероятно, это несовместимый том.";

/* errSecMisc_wrPermErr */
"-61" = "В файл нельзя произвести запись. Возможно, он был открыт с недостаточными правами доступа.";

/* errSecMisc_offLinErr */
"-65" = "Указанное устройство более недоступно. Возможно, оно было извлечено из компьютера.";

/* errSecMisc_dirNFErr */
"-120" = "Не удается найти каталог.";

/* errSecMisc_volGoneErr */
"-124" = "Том сервера теперь недоступен. Возможно, он был отключен от сети.";

/* errSecMisc_userCanceledErr */
"-128" = "Операция была отменена пользователем.";

/* errSecMisc_resNotFound */
"-192" = "Не удается найти запрошенный ресурс.";

/* errSecMisc_resFNotFound */
"-193" = "Затребованный ресурс отсутствует или поврежден.";

/* errSecMisc_icNoURLErr */
"-673" = "Указанный адрес (URL) имеет неизвестный тип или не содержит достаточно информации.";

/* errSecMisc_icConfigNotFoundErr */
"-674" = "Не удается найти программу справки, открывающую указанный URL. ";

/* errSecMisc_cantGetFlavorErr */
"-1854" = "Адрес (URL) этого объекта пропущен или неправильно форматирован.";

/* errSecMisc_afpAccessDenied */
"-5000" = "Было отказано в доступе к этомуобъекту.";

/* errSecMisc_afpUserNotAuth */
"-5023" = "Не удалось выполнить идентификацию. Пароль подключения к этому серверу мог измениться в результате добавления нового объекта в Связку ключей.";
